; domain
(define (domain block-stacking)
  (:predicates
    (clear ?x)
    (on ?x ?y)
    (ontable ?x)
    (holding ?x)
    (handempty)
  )

  (:action pick-up
    :parameters (?x)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (holding ?x)
                 (not (ontable ?x))
                 (not (handempty))
                 (not (clear ?x)))
  )

  (:action put-down
    :parameters (?x)
    :precondition (holding ?x)
    :effect (and (ontable ?x)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x)))
  )

  (:action stack
    :parameters (?x ?y)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (on ?x ?y)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x))
                 (not (clear ?y)))
  )

  (:action unstack
    :parameters (?x ?y)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x)
                 (clear ?y)
                 (not (on ?x ?y))
                 (not (handempty)))
  )
)

; problem
(define (problem block-stacking-problem)
  (:domain block-stacking)

  (:objects B D F G H I J L)

  (:init
    (handempty)
    (clear B) (ontable B)
    (clear D) (ontable D)
    (clear F) (ontable F)
    (clear G) (ontable G)
    (clear H) (ontable H)
    (clear I) (ontable I)
    (clear J) (ontable J)
    (clear L) (ontable L)
  )

  (:goal
    (and
      (on B H)
      (on D B)
      (on F I)
      (on G D)
      (on H L)
      (on I G)
      (on J F)
    )
  )
)

; plan
1. (pick-up h)
   deleted: (ontable h) (handempty) (clear h)
   added: (holding h)
   goals met: 0 of 7
2. (stack h l)
   deleted: (holding h) (clear l)
   added: (on h l) (clear h) (handempty)
   goals met: 1 of 7
3. (pick-up b)
   deleted: (ontable b) (handempty) (clear b)
   added: (holding b)
   goals met: 1 of 7
4. (stack b h)
   deleted: (holding b) (clear h)
   added: (on b h) (clear b) (handempty)
   goals met: 2 of 7
5. (pick-up d)
   deleted: (ontable d) (handempty) (clear d)
   added: (holding d)
   goals met: 2 of 7
6. (stack d b)
   deleted: (holding d) (clear b)
   added: (on d b) (clear d) (handempty)
   goals met: 3 of 7
7. (pick-up g)
   deleted: (ontable g) (handempty) (clear g)
   added: (holding g)
   goals met: 3 of 7
8. (stack g d)
   deleted: (holding g) (clear d)
   added: (on g d) (clear g) (handempty)
   goals met: 4 of 7
9. (pick-up i)
   deleted: (ontable i) (handempty) (clear i)
   added: (holding i)
   goals met: 4 of 7
10. (stack i g)
   deleted: (holding i) (clear g)
   added: (on i g) (clear i) (handempty)
   goals met: 5 of 7
11. (pick-up f)
   deleted: (ontable f) (handempty) (clear f)
   added: (holding f)
   goals met: 5 of 7
12. (stack f i)
   deleted: (holding f) (clear i)
   added: (on f i) (clear f) (handempty)
   goals met: 6 of 7
13. (pick-up j)
   deleted: (ontable j) (handempty) (clear j)
   added: (holding j)
   goals met: 6 of 7
14. (stack j f)
   deleted: (holding j) (clear f)
   added: (on j f) (clear j) (handempty)
   goals met: 7 of 7
